In [1]:
import pandas as pd
import numpy as np

## IMPORTING THE FILE

In [2]:
task=pd.read_csv('task.csv')
task

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

## HEAD  COLUMNS AND DATA

In [3]:
task.head()
task.columns
task.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

## TASK-2

In [4]:
(task.isna().sum())*100/len(task)

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

## TASK-3

In [5]:
task.apply(lambda x: x.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

## TASK-4

In [6]:
#cleaning user_id by replacing empty strings with Nan and converting the column to uppercase
task['user_id']=task['user_id'].replace('',np.nan).str.upper()
task['user_id']

0        USER_0
1         U1001
2         U1002
3           NaN
4           NaN
         ...
995         NaN
996       U1996
997    USER_997
998       U1998
999         NaN
Name: user_id, Length: 1000, dtype: object

## TASK-5

In [7]:
task['age']=pd.to_numeric(task['age'],errors='coerce')
task

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,-5.0,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5.0,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [8]:
task.loc[(task['age']<0) | (task['age']>100),'age']=np.nan
task

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,USER_0,NaN,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30.0,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30.0,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,NaN,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,USER_997,NaN,25000,HR,invalid,Mumbai,3,5,True
998,U1998,NaN,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30.0,45000,HR,2022-01-15,Hyderabad,excellent,five,no

## TASK 6

In [9]:
task['salary']=pd.to_numeric(task['salary'].str.replace('₹',''))
task['salary']

0       50000.00
1       45000.00
2       25000.00
3            NaN
4      120000.75
         ...
995     50000.00
996          NaN
997     25000.00
998     25000.00
999     45000.00
Name: salary, Length: 1000, dtype: float64

## TASK 7

In [10]:
task['join_date']=pd.to_datetime(task['join_date'],errors='coerce', format="%d-%m-%Y")
task['join_date'].head(200)

0     NaT
1     NaT
2     NaT
3     NaT
4     NaT
       ..
195   NaT
196   NaT
197   NaT
198   NaT
199   NaT
Name: join_date, Length: 200, dtype: datetime64[ns]

## TASK 8

In [11]:
task['joining_year']=task['join_date'].dt.year
task['joining_year']

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
995   NaN
996   NaN
997   NaN
998   NaN
999   NaN
Name: joining_year, Length: 1000, dtype: float64

## TASK 9

In [12]:
task['department']=task['department'].str.strip().str.upper()
task

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.00,HR,NaT,DELHI,3,five,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,Delhi,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,Delhi,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5,no,NaN
997,USER_997,NaN,25000.00,HR,NaT,Mumbai,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,Bangalore,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,Hyderabad,excellent,five,no,NaN

## TASK 10

In [13]:
task['city']=task['city'].str.upper()
task

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.00,HR,NaT,DELHI,3,five,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,DELHI,3,1,yes,NaN
2,U1002,30.0,25000.00,HR,NaT,DELHI,excellent,10,False,NaN
3,NaN,NaN,NaN,HR,NaT,HYDERABAD,excellent,5,yes,NaN
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,-1,False,NaN
...,...,...,...,...,...,...,...,...,...,...
995,NaN,60.0,50000.00,HR,NaT,DELHI,2,five,NaN,NaN
996,U1996,NaN,NaN,IT,NaT,MUMBAI,NaN,5,no,NaN
997,USER_997,NaN,25000.00,HR,NaT,MUMBAI,3,5,True,NaN
998,U1998,NaN,25000.00,NaN,NaT,BANGALORE,1,0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,HYDERABAD,excellent,five,no,NaN

## TASK 11

In [14]:
performance_map={'excellent':1,'poor':'0'}
# task['performance_score']=task['performance_score'].map(performance_map)
# task['performance_score']=pd.to_numeric(task['performance_score'],errors='coerce')
# task['performance_score']

In [15]:
task['performance_score']=task['performance_score'].map(performance_map)

In [16]:
task['performance_score']=pd.to_numeric(task['performance_score'],errors='coerce')

In [43]:
task['performance_score']

0      NaN
1      NaN
2      1.0
3      1.0
4      NaN
      ...
995    NaN
996    NaN
997    NaN
998    NaN
999    1.0
Name: performance_score, Length: 1000, dtype: float64

## TASK 12

In [18]:
experience_map={'five':5}

In [23]:
task['experience_years']=task['experience_years'].replace(experience_map)

In [28]:
task['experience_years']=pd.to_numeric(task['experience_years'],errors='coerce')

In [29]:
task.loc[task['experience_years'] < 0, 'experience_years'] = np.nan

In [36]:
active_map={"yes":"True"
            ,"no":"False"}

In [37]:
task["is_active"]=task["is_active"].replace(active_map)
task["is_active"]

0       True
1       True
2      False
3       True
4      False
       ...
995      NaN
996    False
997     True
998     True
999    False
Name: is_active, Length: 1000, dtype: object

## TASK 13

In [42]:
task["is_active"] = task["is_active"].astype(bool)
task["is_active"]

0      True
1      True
2      True
3      True
4      True
       ...
995    True
996    True
997    True
998    True
999    True
Name: is_active, Length: 1000, dtype: bool

## TASK 14

In [46]:
task[task.duplicated(subset="user_id")]

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,NaN,True,NaN
6,NaN,45.0,25000.00,NaN,NaT,MUMBAI,NaN,NaN,True,NaN
7,NaN,45.0,45000.00,NaN,NaT,DELHI,NaN,NaN,True,NaN
12,NaN,60.0,45000.00,IT,NaT,NaN,NaN,5.0,True,NaN
13,NaN,NaN,25000.00,HR,NaT,MUMBAI,NaN,10.0,True,NaN
...,...,...,...,...,...,...,...,...,...,...
992,NaN,18.0,NaN,IT,NaT,MUMBAI,1.0,3.0,True,NaN
993,NaN,NaN,NaN,SALES,NaT,NaN,NaN,5.0,True,NaN
994,NaN,NaN,120000.75,IT,NaT,MUMBAI,0.0,NaN,True,NaN
995,NaN,60.0,50000.00,HR,NaT,DELHI,NaN,5.0,True,NaN
999,NaN,30.0,45000.00,HR,NaT,HYDERABAD,1.0,5.0,True,NaN

## TASK 15

In [44]:
task.head()

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.00,HR,NaT,DELHI,NaN,5.0,True,NaN
1,U1001,30.0,45000.00,FINANCE,NaT,DELHI,NaN,1.0,True,NaN
2,U1002,30.0,25000.00,HR,NaT,DELHI,1.0,10.0,True,NaN
3,NaN,NaN,NaN,HR,NaT,HYDERABAD,1.0,5.0,True,NaN
4,NaN,NaN,120000.75,IT,NaT,DELHI,NaN,NaN,True,NaN

In [45]:
task.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            490 non-null    object
 1   age                534 non-null    float64
 2   salary             689 non-null    float64
 3   department         859 non-null    object
 4   join_date          0 non-null      datetime64[ns]
 5   city               851 non-null    object
 6   performance_score  249 non-null    float64
 7   experience_years   735 non-null    float64
 8   is_active          1000 non-null   bool
 9   joining_year       0 non-null      float64
dtypes: bool(1), datetime64[ns](1), float64(5), object(3)
memory usage: 71.4+ KB